sysbench/results/local/vitess/alta/parallel/re-test-notBetwenAndPoint1/read_2.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            15011
        write:                           0
        other:                           0
        total:                           15011
    transactions:                        15011  (249.58 per sec.)
    queries:                             15011  (249.58 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1411s
    total number of events:              15011

Latency (ms):
         min:                                   14.21
         avg:                                  200.10
         max:                                  683.45
         95th percentile:                      344.08
         sum:                              3003658.87

Threads fairness:
    events (avg/stddev):           300.2200/3.99
    execution time (avg/stddev):   60.0732/0.04